Extensions installed on WSL: Ubuntu:
batisteo.vscode-django
bierner.markdown-mermaid
bracketpaircolordlw.bracket-pair-color-dlw
bradlc.vscode-tailwindcss
christian-kohler.path-intellisense
clinyong.vscode-css-modules
dbaeumer.vscode-eslint
docker.docker
donjayamanne.githistory
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-complete-tag
formulahendry.auto-rename-tag
github.copilot-chat
github.vscode-github-actions
golang.go
google.geminicodeassist
googlecloudtools.cloudcode
hashicorp.terraform
kevinrose.vsc-python-indent
luongnd.edge
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.autopep8
ms-python.debugpy
ms-python.flake8
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.makefile-tools
ms-vscode.vscode-typescript-next
naumovs.color-highlight
njpwerner.autodocstring
prisma.prisma
publishertemp.whitebox-xai-agent
redhat.java
redhat.vscode-yaml
ritwickdey.liveserver
saoudrizwan.claude-dev
sst-dev.opencode
stef-k.adonis-js-goto-controller
stef-k.adonis-js-goto-view
steoates.autoimport
syler.sass-indented
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
wallabyjs.console-ninja
wholroyd.jinja
zignd.html-css-class-completion
